Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetRadial.Attributes Property
 The curved dimension set radial attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes Attributes { get; set; }
Public Property Attributes As CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes
	Get
	Set
Property Value
Type: CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes
See Also
Reference
CurvedDimensionSetRadial Class
Tekla.Structures.Drawing Namespace